import { Container, Typography } from "@mui/material";

const TermsAndConditions = () => {
  return (
    <Container
      sx={{
        gap: 3,
        display: "flex",
        flexDirection: "column",
        maxWidth: "700px",
        mb: 10,
      }}
    >
      <div className="order-sec2">
        <div className="order-text1">شروط الأستخدام</div>
      </div>
      <Typography sx={{ fontFamily: "pun-bold", color: "#315e5e", mt: 3 }}>
        نحن نتأكد من أن لدينا سياسة خصوصية لمساعدتنا في التسويق لك ، مع حمايتك
        بكل طريقة ممكنة. فيما يلي الإجابات على بعض الأسئلة التي قد تجدها مفيدة.
        إذا كنت مهتمًا بأي شيء في سياسة الخصوصية الخاصة بنا ، فيرجى إخبارنا
        بذلك. لا يوجد شيء أكثر أهمية بالنسبة لنا من ثقتك بنا ورضاك في منتجاتنا
        وخدماتنا.
      </Typography>
      <Typography sx={{ fontFamily: "pun-bold", color: "#315e5e", mt: 3 }}>
        ما هي المعلومات التي نقوم بجمعها؟
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}>
        نقوم بجمع المعلومات منك عند التسجيل على موقعنا أو تقديم طلب ،
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}>
        عند الطلب أو التسجيل على موقعنا ، حسب الاقتضاء ، قد يُطلب منك إدخال اسمك
        أو عنوان بريدك الإلكتروني أو عنوانك البريدي أو رقم هاتفك أو معلومات
        بطاقة الائتمان الخاصة بك.
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}>
        تستخدم المنصات الاعلانية بصفتها مورِّدًا خارجيًا ، ملفات تعريف الارتباط
        لعرض الإعلانات لك
      </Typography>
      <Typography sx={{ fontFamily: "pun-bold", color: "#315e5e", mt: 3 }}>
        في ماذا نستخدم المعلومات الخاصة بك؟
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}>
        يمكن استخدام أي من المعلومات التي نجمعها منك بإحدى الطرق التالية:
      </Typography>
      <ul>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            لتخصيص تجربتك – (تساعدنا معلوماتك على الاستجابة بشكل أفضل لاحتياجاتك
            الفردية).
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            لتخصيص تجربتك – (تساعدنا معلوماتك على الاستجابة بشكل أفضل لاحتياجاتك
            الفردية).
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            لتحسين موقعنا على الإنترنت – (نسعى باستمرار لتحسين عروض موقعنا على
            أساس المعلومات والتعليقات التي نتلقاها منك.
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            لتحسين خدمة العملاء – (تساعدنا معلوماتك على الاستجابة بشكل أكثر
            فعالية لطلبات خدمة العملاء واحتياجات الدعم).
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            لمعالجة المعاملات (لن يتم بيع معلوماتك ، سواء كانت عامة أو خاصة ، أو
            تبادلها ، أو نقلها ، أو منحها إلى أي شركة أخرى لأي سبب من الأسباب ،
            دون موافقتك ، بخلاف الغرض الصريح المتمثل في تقديم المنتج المباع أو
            الخدمة المطلوبة).
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            لإرسال رسائل بريد إلكتروني أو رسائل جوال دورية – (سيتم استخدام عنوان
            البريد الإلكتروني أو رقم جوالك الذي تقدمه لمعالجة الطلب فقط لإرسال
            المعلومات والتحديثات المتعلقة بطلبك).
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            لن يتم تخزين أي من بيانات البطاقات الائتمانية وبطاقات الخصم المباشر
            بالإضافة إلى المعلومات الشخصية أو بيعها أو مشاركتها أو تأجيرها إلى
            أي أطراف خارجية.
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            قد يتم تغيير السياسات والشروط والأحكام الخاصة بالموقع الإلكتروني أو
            تحديثها من وقت لآخر وذلك حتّى يتم استيفاء جميع المعايير القياسية
            المعمول بها. بالتالي فإننّا نحثّ العميل على الرجوع إلى هذه الأقسام
            بشكل متكرّر وذلك لمعرفة التغييرات التي تتم على الموقع الإلكتروني.
            التعديلات الجديدة ستصبح سارية في نفس الوقت الذي يتم نشرها على الموقع
            الإلكتروني.
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}
          >
            بعض من الإعلانات التي تراها على الموقع يتم اختيارها وتقديمها من قبل
            أطراف خارجية مثل الشبكات ووكالات الإعلانات والمُعلنين الأفراد
            ومقدّمي بيانات الزوّار. قد تعمل هذه الأطراف الخارجية على جمع أنشطتك
            على الإنترنت سواء كانت على هذا الموقع الإلكتروني أو المواقع
            الإلكترونية الأخرى وذلك من خلال ملفات تعريف الارتباط (كوكيز) وإشارات
            الويب وتقنيات أخرى، حيث أن ذلك بهدف فهم ما هي اهتماماتك وعرض لك
            الإعلانات المناسبة لهذه الاهتمامات. ننوّه بأننا ليس لدينا أي سلطة
            للوصول أو للتحكّم في المعلومات التي قد تجمعها هذه الأطراف الخارجية.
            كما أن الممارسات التي تتبّعها هذه الأطراف الخارجية لجمع المعلومات
            غير واردة في هذه السياسة.
          </Typography>
        </li>
      </ul>
      <Typography sx={{ fontFamily: "pun-bold", color: "#315e5e", mt: 3 }}>
        كوكيز:
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}>
        نستخدم أداة جمع البيانات المعروفه باسم “ملفات تعريف الارتباط كوكيز” في
        مراحل معينة من استخدام موقعنا الإلكتروني. “ملفات تعريف الارتباط كوكيز”
        هي ملفات صغيرة موجودة على القرص الثابت لجهازك المحمول / الكمبيوتر /
        الجهاز والتي تساعدنا في تقديم خدمات مخصصة. يساعدنا ملف تعريف الارتباط في
        تحليل تفضيلاتك ، على سبيل المثال ، تسجيل عدد المرات التي استخدمت فيها
        موقع الويب ، ومساعدتنا في تصميم خدماتنا لتناسب اهتماماتك. علاوة على ذلك
        ، هناك ميزات معينة للموقع متاحة فقط من خلال استخدام “ملف تعريف
        الارتباط”. يمكن استخدام “ملفات تعريف الارتباط” هذه سواء قمت بالتسجيل على
        الموقع أم لا. ومع ذلك ، فإن “ملف تعريف الارتباط” لا يمنحنا حق الوصول إلى
        جهازك. يمكنك اختيار تعطيل ميزة “ملف تعريف الارتباط” على جهازك. ولكن هذا
        قد يمنع الاستفادة الكاملة من الخدمات التي يقدمها الموقع.
      </Typography>
      <Typography sx={{ fontFamily: "pun-bold", color: "#315e5e", mt: 3 }}>
        الكشف عن معلوماتك لأطراف ثالثة:
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#315e5e", marginBlock: 1 }}>
        نحن لا نبيع أو نتاجر أو ننقل معلوماتك الشخصية إلى أطراف خارجية. لا يشمل
        هذا الجهات الخارجية الموثوقة التي تساعدنا في تشغيل موقعنا الإلكتروني ،
        أو إجراء أعمالنا ، أو خدمتكم ، طالما أن تلك الأطراف توافق على الحفاظ على
        سرية هذه المعلومات. يجوز لنا أيضًا نشر معلوماتك عندما نعتقد أن النشر
        مناسب للامتثال للقانون ، أو فرض سياسات موقعنا ، أو حماية حقوقنا أو
        ممتلكاتنا أو سلامتنا أو حقوق الآخرين. ومع ذلك ، قد يتم توفير معلومات
        الزائر غير الشخصية لأطراف أخرى للتسويق أو الإعلان أو الاستخدامات الأخرى
      </Typography>
    </Container>
  );
};

export default TermsAndConditions;
