import { Container, Typography } from "@mui/material";

const TermsAndConditions = () => {
  return (
    <Container
      sx={{
        gap: 3,
        display: "flex",
        flexDirection: "column",
        maxWidth: "700px",
        mb: 10,
      }}
    >
      <div className="order-sec2">
        <div className="order-text1">سياسة الخصوصية</div>
      </div>
      {/* <Typography sx={{ fontFamily: "pun-bold", color: "#0D1786", mt: 3 }}>
        نحن نتأكد من أن لدينا سياسة خصوصية لمساعدتنا في التسويق لك ، مع حمايتك
        بكل طريقة ممكنة. فيما يلي الإجابات على بعض الأسئلة التي قد تجدها مفيدة.
        إذا كنت مهتمًا بأي شيء في سياسة الخصوصية الخاصة بنا ، فيرجى إخبارنا
        بذلك. لا يوجد شيء أكثر أهمية بالنسبة لنا من ثقتك بنا ورضاك في منتجاتنا
        وخدماتنا.
      </Typography> */}
      <Typography sx={{ fontFamily: "pun-bold", color: "#0D1786", mt: 3 }}>
        ما هي المعلومات التي نقوم بجمعها؟
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        فالمعلومات الشخصية التي نقوم بتجميعها تتضمن اللقب، الاسم، الجنس، عنوان
        البريد الالكتروني، عنوان البريد، عنوان التسليم (لو اختلف)، رقم الهاتف
        ورقم المتحرك. وقد نقوم بتجميع المعلومات الشخصية المتوفرة والمقدمة من
        جانبكم بالإضافة الى او كجزء من اي تقديم.
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        ونحن لا نقوم بتجميع تفاصيل الدفعات، تفاصيل بطاقة الدفع او تفاصيل الحساب
        البنكي. ويتم تجميع هذه التفاصيل خلال عملية الشراء من جانب مزود الدفع من
        قبلنا والمعروف باسم باي فورت ولا يقوم بمشاركة المعلومات معنا.
      </Typography>
      <Typography sx={{ fontFamily: "pun-bold", color: "#0D1786", mt: 3 }}>
        المعلومات الاخرى التي نقوم بتجميعها
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        سنقوم بتجميع معلومات معينة (مثل وقت وتاريخ زيارتكم للموقع، الصفحات التي
        تمت مراجعتها والاطلاع عليها، عنوان التعريف الشخصي والمتصفح الذي
        استخدمناه للوصول الى الموقع) متى انكم تقومون بزيارة الموقع. ونحن نستعمل
        هذه المعلومات لفهم كيف يتم استعمال موقعنا ولتحسين الموقع ايضاً. وان هذه
        المعلومات مجهولة المصدر ولا يمكن ربطها ولا وصلها مرة اخرى اليكم.
      </Typography>
      <Typography sx={{ fontFamily: "pun-bold", color: "#0D1786", mt: 3 }}>
        كيف نقوم باستعمال معلوماتكم الشخصية
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        سنقوم باستعمال معلوماتكم الشخصية لأجل:
      </Typography>
      <ul>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}
          >
            انشاء وتأسيس وادارة حسابكم، العملية الاجرائية وتسليم طلبياتكم
            لتزويدكم بالخدمات والمعلومات.
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}
          >
            لتحسين المخطط البياني العام وشكل الموقع الالكتروني، المحتوى
            والوظائفية الخاصة به.
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}
          >
            القيام بالبحث على التركيبة السكانية لمستخدمينا واذواقهم
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}
          >
            وقد نقوم باستعمال معلوماتكم الشخصية لنرسل إليكم معلوماتٍ حول
            منتجاتنا وخدماتنا وتلك من الشركات المنتسبة والتابعة لنا. يمكنكم
            الاختيار الانسحاب من هذا في اي وقت عن طريق الضغط على وصلة الربط لـ
            "الغاء الاشتراك" في اي بريد تسويقي نقوم بأرساله اليكم.
          </Typography>
        </li>
        <li>
          <Typography
            sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}
          >
            في حالة تم تفعيل إشعارات الوتساب فيما يتعلق بحسابك أو معملاتك ولم
            تعد ترغب في استقبالها, يمكنك تعطيل الإشعارات في أي وقت بالنقر هنا.
          </Typography>
        </li>
      </ul>
      {/* <Typography sx={{ fontFamily: "pun-bold", color: "#0D1786", mt: 3 }}>
        كوكيز:
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        نستخدم أداة جمع البيانات المعروفه باسم “ملفات تعريف الارتباط كوكيز” في
        مراحل معينة من استخدام موقعنا الإلكتروني. “ملفات تعريف الارتباط كوكيز”
        هي ملفات صغيرة موجودة على القرص الثابت لجهازك المحمول / الكمبيوتر /
        الجهاز والتي تساعدنا في تقديم خدمات مخصصة. يساعدنا ملف تعريف الارتباط في
        تحليل تفضيلاتك ، على سبيل المثال ، تسجيل عدد المرات التي استخدمت فيها
        موقع الويب ، ومساعدتنا في تصميم خدماتنا لتناسب اهتماماتك. علاوة على ذلك
        ، هناك ميزات معينة للموقع متاحة فقط من خلال استخدام “ملف تعريف
        الارتباط”. يمكن استخدام “ملفات تعريف الارتباط” هذه سواء قمت بالتسجيل على
        الموقع أم لا. ومع ذلك ، فإن “ملف تعريف الارتباط” لا يمنحنا حق الوصول إلى
        جهازك. يمكنك اختيار تعطيل ميزة “ملف تعريف الارتباط” على جهازك. ولكن هذا
        قد يمنع الاستفادة الكاملة من الخدمات التي يقدمها الموقع.
      </Typography> */}
      <Typography sx={{ fontFamily: "pun-bold", color: "#0D1786", mt: 3 }}>
        المشاركة بمعلوماتكم الشخصية مع اطراف ثالثة
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        أرامكس، ولأغراض تسليم الطلبية.
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        الاطراف الثالثة الذين يزودوننا بالخدمات، من اجل تزويدنا بتلك الخدمات
        (مثلاً، التسويق، ادارة الموقع الالكتروني وخدمات الحماية من الاحتيال).
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        اية سلطة حكومية او قانونية لو تطلب القانون ذلك.
      </Typography>
      <Typography sx={{ fontFamily: "pun", color: "#0D1786", marginBlock: 1 }}>
        وقد نقوم بنقل وتحويل قواعد بياناتنا التي تحتوي معلوماتكم الشخصية لو اننا
        نقوم ببع نشاطنا واعمالنا او جزء منها. وغير ما يكون الموضح والمبين في
        سياسة الخصوصية هذه، فإننا لن نقوم ببيع او الافصاح عن معلوماتكم الشخصية
        لأطراف ثالثة بدون الحصول على موافقتكم المسبقة. وقد يحتوي الموقع وصلات
        ربط لمواقع اخرى او هياكل لمواقع اخرى. برجاء الاطلاع والعلم بأننا غير
        مسئولين عن ممارسات الخصوصية او محتوى تلك المواقع الاخرى الخاصة بالأطراف
        الثالثة، ولا لأي طرف ثالث له نقوم بتحويل معلوماتكم الشخصية وفقاً
        لسياستنا الخاصة بالخصوصية
      </Typography>
    </Container>
  );
};

export default TermsAndConditions;
